I have the feeling (sorry, cannot say for sure) that it worked a couple of days ago with the same version. Maybe Microsoft changed (broke) something?!

As a workaround, I am now using an alternate provider config (via `alias`) just for managing groups:

~~~
terraform {
  required_version = ">= 1.0"

  required_providers {
    azuread = {
      source  = "hashicorp/azuread"
      version = "1.6.0"
    }
  }
}

provider "azuread" {
  tenant_id           = "..."
  use_microsoft_graph = true
}

provider "azuread" {
  alias               = "groups"
  tenant_id           = "..."
  use_microsoft_graph = false
}

resource "azuread_group" "foo" {
  display_name = "foo"
}

resource "azuread_group" "bar" {
  provider = azuread.groups

  display_name = "bar"
}
~~~

~~~
$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azuread_group.bar will be created
  + resource "azuread_group" "bar" {
      + display_name            = "bar"
      + id                      = (known after apply)
      + mail_enabled            = (known after apply)
      + members                 = (known after apply)
      + name                    = (known after apply)
      + object_id               = (known after apply)
      + owners                  = (known after apply)
      + prevent_duplicate_names = false
      + security_enabled        = (known after apply)
    }

  # azuread_group.foo will be created
  + resource "azuread_group" "foo" {
      + display_name            = "foo"
      + id                      = (known after apply)
      + mail_enabled            = (known after apply)
      + members                 = (known after apply)
      + name                    = (known after apply)
      + object_id               = (known after apply)
      + owners                  = (known after apply)
      + prevent_duplicate_names = false
      + security_enabled        = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

azuread_group.bar: Creating...
azuread_group.foo: Creating...
azuread_group.bar: Still creating... [10s elapsed]
azuread_group.bar: Creation complete after 10s [id=a8341fce-6014-431a-a54b-b1ad0e9bf9ec]
╷
│ Error: Creating group "foo"
│ 
│   with azuread_group.foo,
│   on main.tf line 23, in resource "azuread_group" "foo":
│   23: resource "azuread_group" "foo" {
│ 
│ GroupsClient.BaseClient.Post(): unexpected status 400 with OData error: Request_BadRequest: Request contains a property with duplicate values.
╵
~~~

Hope this helps at least until the fix arrives.